#language: ru

@tree

Функционал: Проверка заполнения полей Заказ покупателя

Как Администратор я хочу
проверить доступность полей в документе Заказ покупателя
чтобы корректной работы документа   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Проверка заполнения полей Заказ покупателя
	* Заполнение данными
	//здесь должно быть заполнение данными
	* Открытие документа
		И В командном интерфейсе я выбираю "Продажи" "Заказы покупателей"
		Тогда открылось окно "Заказы покупателей"
		И я нажимаю на кнопку с именем 'FormCreate'
		Тогда открылось окно "Заказ покупателя (создание)"
	* Проверка полей
		И элемент формы "Контрагент" не доступен
		И элемент формы "Соглашение" доступен
		И я нажимаю кнопку выбора у поля с именем 'Partner'
		Тогда открылось окно "Партнеры"
		И в таблице 'List' я активизирую поле с именем 'Description'
		И в таблице 'List' я выбираю текущую строку
		И элемент формы "Контрагент" доступен
		И элемент формы "Соглашение" доступен

	
				
