#language: ru

@tree

Функционал: Тест отчета D2001 по наличию возвратов

Как Администратор я хочу
протестировать процесс вывода возвратов в отчет 
чтобы проверить корректность работы отчета   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Тест отчета по возвратам
	* Заполнение данных
		//здесь заполняются данные из доп фичи
	* Открытие отчета
		И В командном интерфейсе я выбираю "Отчеты" "D2001 Продажи"
		Тогда открылось окно "D2001 Продажи"
		И в табличном документе 'Result' я перехожу к ячейке "R1C1"
		И я нажимаю на кнопку с именем 'FormStandardSettings'
		И я нажимаю на кнопку с именем 'FormGenerate'
		И я жду когда в табличном документе "Result" заполнится ячейка "R7C2" в течение 20 секунд
		И в табличном документе "Result" я перехожу к ячейке "R7C2"
				
		И Я запоминаю в переменную "ИтогПроверки" значение "Ложь"
		И Я запоминаю в переменную "ТекущееЗначение" значение " "
		И пока выражение встроенного языка '$ТекущееЗначение$ <> ""' истинно тогда
			попытка
				И я запоминаю значение текущей ячейки "Result" в переменную "ТекущееЗначение"
				И переменная '$ТекущееЗначение$' имеет значение "-1,000"
				//И в табличном документе "Result" значения в текущей ячейке соответствуют условию  "меньше"  0
				Тогда Я запоминаю в переменную "ИтогПроверки" значение "Истина"
				Тогда я прерываю цикл
			Исключение					
			
			И в табличном документе "Result" я перехожу на 1 ячеек вниз
		КонецЦикла
		И переменная '$ИтогПроверки$' имеет значение "Истина"
			
				
				