#language: ru

@tree

Функционал: Заполнение компании с условием в Заказе покупателя

Как Администратор я хочу
заполнение поля Организация на форме Заказа покупателя с условием 
чтобы иметь более настраиваемый тест   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Заполнение компании с условием в Заказе покупателя
	* Открытие формы Заказа
		И В командном интерфейсе я выбираю "Продажи" "Заказы покупателей"
		Тогда открылось окно "Заказы покупателей"
		И я нажимаю на кнопку с именем 'FormCreate'
		Тогда открылось окно "Заказ покупателя (создание)"
	* Заполнение соглашения
		И я нажимаю кнопку выбора у поля с именем 'Agreement'
		Тогда открылось окно "Соглашения"
		И в таблице 'List' я активизирую поле с именем 'Description'
		И в таблице 'List' я выбираю текущую строку
		Тогда открылось окно "Заказ покупателя (создание) *"
		И в таблице 'ItemList' я активизирую поле с именем 'ItemListLineNumber'
	* Заполнение поля Организация
		Если элемент формы "Организация" имеет значение "" тогда
			Когда открылось окно "Заказ покупателя (создание) *"
			И я нажимаю кнопку выбора у поля с именем 'Company'
			Тогда открылось окно "Организации"
			И в таблице 'List' я активизирую поле с именем 'Description'
			И в таблице 'List' я выбираю текущую строку
						
						
