#language: ru

@tree

Функционал: <описание фичи>

Как Администратор я хочу
создать в справочнике Номенклатура n-количество элементов с различными наименованиями 
чтобы проверить возможность создания

Переменные:
	КоличествоШагов = 10

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Создание номенклатуры
	* Подготовка к созданию
		И Я запоминаю значение выражения '1' в переменную "ТекущийШаг"
	* Цикл создания элементов
		И я делаю '$КоличествоШагов$' раз
			И Я запоминаю значение выражения '"Тестовый товар " + $ТекущийШаг$' в переменную "НаименованиеТовара"
			И Я запоминаю значение выражения '"Test Item " + $ТекущийШаг$' в переменную "НаименованиеТовараEN"
			И я проверяю или создаю для справочника "Items" объекты:
			| 'Ref'                                                           	| 'DeletionMark' | 'PackageUnit' | 'Description_en'           	| 'Description_hash' | 'Description_ru' 				| 'Description_tr' | 'Height' | 'Length' | 'Volume' | 'Weight' | 'Width' |
			|'{"e1cib/data/Catalog.Items?ref=" + StrReplace(New UUID, "-", "")}'| 'False'        | ''            | '$НаименованиеТовараEN$' 	| ''                 | '$НаименованиеТовара$'			| ''               |          |          |          | 		    |         |
			И Я запоминаю значение выражения '$ТекущийШаг$ + 1' в переменную "ТекущийШаг"
		
		
